Autodesk.Revit.DB.Structure.IExtElemChangeBeamSection.ChangeSection(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
The method that will be called when user wants to change beam section
doc:
Revit document
idElem:
id of the selected element
Returns:
Indicates whether the operation succeeded or not
Since:
2018

Autodesk.Revit.DB.Structure.IExtElemChangeBeamSection
Interface Change Beam section functionality to be implemented in add-ins
Since:
2018